tap "homebrew/bundle"
brew "cmake"
brew "cmatrix"
brew "codespell"
brew "direnv"
brew "fd"
brew "flatbuffers"
brew "fzf"
brew "isort"
brew "lsd"
brew "neovim"
brew "node"
brew "protobuf"
brew "pyright"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "shellcheck"
brew "swift"
brew "tmux"
brew "yarn"
cask "miniconda"
cask "vlc"
