tap "homebrew/bundle"
brew "autoconf"
brew "automake"
brew "cmake"
brew "cmatrix"
brew "codespell"
brew "direnv"
brew "fd"
brew "flatbuffers"
brew "fzf"
brew "git-lfs"
brew "haxe"
brew "huggingface-cli"
brew "isort"
brew "lazygit"
brew "libtool"
brew "lsd"
brew "neofetch"
brew "neovim"
brew "node"
brew "python-filelock"
brew "python-platformdirs"
brew "pdm"
brew "pkg-config"
brew "poetry"
brew "protobuf"
brew "pyright"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "sevenzip"
brew "shellcheck"
brew "swift"
brew "tmux"
brew "wget"
brew "yarn"
cask "miniconda"
cask "raycast"
cask "rectangle"
cask "vlc"
