tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "sqitchers/sqitch"
brew "python@3.9"
brew "awscli"
brew "coreutils"
brew "tmux"
brew "byobu"
brew "ctags"
brew "fd"
brew "fzf"
brew "ghi"
brew "git"
brew "go"
brew "graphviz"
brew "hub"
brew "jq"
brew "kotlin-language-server"
brew "lazygit"
brew "lua"
brew "tree-sitter"
brew "neovim"
brew "ninja"
brew "node"
brew "opam"
brew "pyright"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "heroku/brew/heroku"
brew "sqitchers/sqitch/sqitch", args: ["with-postgres-support", "with-sqlite-support"]
cask "amethyst"
cask "edex-ui"
cask "font-meslo-lg-nerd-font"
cask "kitty"
cask "sfdx"
cask "stats"
